{"index":{"slug":"index","filePath":"index.md","title":"index","links":["recsys/"],"tags":[],"content":"👋 Welcome\nThis is where I put whatever I’m currently reading or interested in — mostly papers, notes, and personal reflections.\n📚 Topics\n\nPapers on Recommender Systems\n→ See: RecSys\n\nFeel free to explore via the graph view (top right), tags, or backlinks. Everything is a work in progress — and that’s the point."},"recsys/A-Comprehensive-Review-of-Recommender-Systems---Transitioning-from-Theory-to-Practice":{"slug":"recsys/A-Comprehensive-Review-of-Recommender-Systems---Transitioning-from-Theory-to-Practice","filePath":"recsys/A Comprehensive Review of Recommender Systems - Transitioning from Theory to Practice.md","title":"A Comprehensive Review of Recommender Systems - Transitioning from Theory to Practice","links":["recsys/Dynamic-Graph-Neural-Networks-for-Sequential-Recommendation","recsys/Frequency-Enhanced-Hybrid-Attention-Network-for-Sequential-Recommendation","recsys/Knowledge-Prompt-tuning-for-Sequential-Recommendation","recsys/Bayesian-Knowledge-driven-Critiquing-with-Indirect-Evidence","recsys/DiffKG---Knowledge-Graph-Diffusion-Model-for-Recommendation","recsys/Towards-Hierarchical-Policy-Learning-for-Conversational-Recommendation-with-Hypergraph-based-Reinforcement-Learning","recsys/RecMind---Large-Language-Model-Powered-Agent-For-Recommendation","recsys/Adaptive-Multi-Modalities-Fusion-in-Sequential-Recommendation-Systems","recsys/PromptMM---Multi-Modal-Knowledge-Distillation-for-Recommendation-with-Prompt-Tuning","recsys/Explainable-Fairness-in-Recommendation","recsys/Bias-Reduction-News-Recommendation-System","recsys/Fairness-among-New-Items-in-Cold-Start-Recommender-Systems"],"tags":["paper","survey"],"content":"Abstract\nRecommender Systems (RS) play an integral role in enhancing user experiences by providing personalized item suggestions. This survey reviews the progress in RS inclusively from 2017 to 2024, effectively connecting theoretical advances with practical applications. We explore the development from traditional RS techniques like content-based and collaborative filtering to advanced methods involving deep learning, graph-based models, reinforcement learning, and large language models. We also discuss specialized systems such as context-aware, review-based, and fairness-aware RS. The primary goal of this survey is to bridge theory with practice. It addresses challenges across various sectors, including e-commerce, healthcare, and finance, emphasizing the need for scalable, real-time, and trustworthy solutions. Through this survey, we promote stronger partnerships between academic research and industry practices. The insights offered by this survey aim to guide industry professionals in optimizing RS deployment and to inspire future research directions, especially in addressing emerging technological and societal trends2 . The survey resources are available in the public GitHub repository github.com/VectorInstitute/Recommender-Systems-Survey.\nIntroduction\nMain Contributions\n\nThis survey provides a comprehensive review of RS, tracing their development from theoretical foundations to practical applications between 2017 and 2023. It is the first survey to specifically highlight the translation of theoretical advancements into practical solutions for industry challenges.\nEach type of RS is thoroughly examined, including data input methods, associated challenges, relevant datasets, evaluation metrics, model accuracy, and practical applications, as presented in tables. The survey aims to offer industry professionals a set of guidelines to facilitate the deployment of these systems in real-world settings.\nWe discuss the specific challenges faced by RS in various sectors, such as e-commerce, healthcare, finance, and others. The survey emphasizes the need for scalable, real-time, and privacy-focused solutions, demonstrating how theoretical insights can address these industry-specific demands.\n\n\nTraditional RS methods can be categorized into collaborative filtering, content-based filtering, and hybrid approaches.\nCollaborative filtering (CF) [70] is based on the idea that users with similar preferences will likely have similar tastes in the future. CF recommends items by finding a neighborhood of similar users or items. CF can recommend items without needing much content analysis, however, it normally faces challenges like cold starts, scalability, and sparsity.\n\nContent-based filtering (CBF) [72] recommends items based on a user past preferences and item characteristics, using techniques like Term Frequency- Inverse Document Frequency (TF-IDF), cosine similarity, and neural networks for item representation. However, it may struggle with recommending new or unseen items.\n\nHybrid RS [36] combine the strengths of both approaches, offering more accurate and personalized recommendations by integrating diverse methodologies.\n\nModeling Techniques\nGraph-based Recommender Systems\nGNNs can effectively address various practical challenges by modeling complex relationships in data.\n\nDynamic Graph Neural Networks for Sequential Recommendation\nSequential and Session-based Recommender Systems\nSequential recommendation is commonly viewed as a next-item or next-basket prediction challenge [37]. Both the sequential and session-based RS leverage user action sequences to anticipate users’ future preferences [95]. Specifically, sequential RS consider the interaction histories of the users to predict future behaviour or users’ preferences. In contrast, session-based RS, detailed in survey [38], focus on short-term user activity for real-time recommendations. These approaches collectively enhance personalization and relevance across diverse platforms.\nFrequency Enhanced Hybrid Attention Network for Sequential Recommendation\nKnowledge Prompt-tuning for Sequential Recommendation\nKnowledge-based Recommender Systems\nA KG is a directed graph G = (V, E), where V and E represent entities and relations between them, respectively, with E ⊆ V × V . It includes entity type function Φ : V → A and relation type function Ψ : E → R, mapping entities to types A and relations to types R. KGs are depicted as sets of triples ⟨eh, r, et⟩, signifying a relation r from eh to et.\nEmbedding-based approaches focus on learning and applying embeddings to represent KG entities (nodes) and relations (edges), enhancing user and item representations. They typically start with initial embedding generation using models like TransE [309], TransD [198], and node2vec [310], followed by their application in RS through attention mechanisms in KSR [229] or generative models like BEM [176] and KTGAN [311].\nJoint Learning Methods optimize both KG embeddings and recommendation components simultaneously using a unified loss function. Examples include CKE [112], which integrates auto-encoders for item representations, and SHINE [312], which acquires user embeddings from heterogeneous graphs. Multi-Task Methods such as KTUP [221] and MKR [206] address KG-enhanced recommendation and KG completion concurrently, improving both entity/relation representations and recommendations.\nPropagation-based approaches influence embeddings through multi-hop neighbor interactions within the KG. Item KG-based methods like Ripplenet [215] aggregate item-related embeddings to derive user interests, whereas User-Item KG-based methods such as KGAT [197] and Intentgc [195] refine both user and item embeddings by propagating embeddings across a user-item graph, enhancing recommendation accuracy.\nOverall, these systems enable more contextually aware, personalized, and efficient recommendation systems, significantly improving user experience across these sectors.\nBayesian Knowledge-driven Critiquing with Indirect Evidence\nDiffKG - Knowledge Graph Diffusion Model for Recommendation\nReinforcement Learning-based Recommender Systems\nBy employing techniques such as deep Q-networks and policy gradient methods, RL-based recommender systems continuously refine their decision-making processes, leading to improved long-term user engagement and satisfaction.\nTowards Hierarchical Policy Learning for Conversational Recommendation with Hypergraph-based Reinforcement Learning\nLarge Language Model based Recommender Systems\nThe integration of BERT-like models into RS has led to significant advancements. Initial applications like BERT4REC [228] utilized deep bidirectional self-attention for modeling user behavior sequences, while further developments employed BERT for tasks ranging from conversational RS [78] to CTR prediction [339]. Enhancements in BERT-based models have addressed specific RS challenges, such as item alignment in dialogues [340] and user representation through models like U-BERT [341] and UserBERT [342]. Further innovations include BERT-based re-ranking [343] and addressing data sparsity in group recommendations [344].\nPrompt-based and in-context learning (ICL) approaches have leveraged the adaptability of LLMs, employing personalized prompts and natural language processing to enhance recommendation relevance and user interaction without extensive retraining [345, 293].\nLLMs have advanced RS by addressing key challenges such as the cold-start problem, enhancing personalization, and improving accuracy.\nRecMind - Large Language Model Powered Agent For Recommendation\nMultimodal Recommender Systems\nThe evolution of multi-modal RS began with the introduction of Visual Bayesian Personalized Ranking (VBPR) [349], which enhances personalized ranking by integrating visual features from product images. The results showed improved accuracy and addressing cold-start issues. Attentive Collaborative Filtering (ACF) [350] introduced a novel attention mechanism to better handle item- and component-level feedback in multimedia recommendations.\nCollaborative Cross Networks (CoNet) [351] utilizes deep transfer learning. Multi-Modality enriched Sequential Recommendation (MMSR) [249], a graph-based model, adaptively fuses multi-modal information to dynamically prioritize modalities based on their sequential relationships.\nAdaptive Multi-Modalities Fusion in Sequential Recommendation Systems\nPromptMM - Multi-Modal Knowledge Distillation for Recommendation with Prompt-Tuning\nSpecialized Recommender Systems\nContext-aware Recommender Systems\nContext-aware recommender systems (CARS) are advanced RS that enhance the personalization of content by incorporating contextual information into the recommendation process [33]. Unlike traditional RS that primarily rely on user-item interactions, CARS consider additional dimensions such as time, location, social settings, and user behavior patterns to deliver more relevant and timely suggestions [352].\nAmong these, factorization machines (FM) [353] are prominent for their ability to capture interactions between variables within large datasets. Field-Aware Factorization Machines (FFMs) [354] are specifically optimized for CTR prediction, showing the versatility and depth of models developed for enhancing CARS’ performance.\nReview-based Recommender Systems\nA review-based RS uses textual reviews and ratings from users to generate personalized recommendations for products or services [358, 45]. The review-based RS have evolved by improving through various models. Initially, models like Hidden Factors as Topics (HFT) [359] aligned topics from reviews with latent dimensions from ratings. Successive approaches, such as Rating-Boosted Latent Topics (RBLT) [360], Topic Initialized Latent Factor Model (TIM) [307], and deep learning models like Convolutional Matrix Factorization (ConvMF) [361] and Deep Cooperative Neural Networks (DeepCoNN) [87], utilized neural networks to better handle sparse data and extract nuanced features from reviews.\nAspect-based Recommender Systems\nAspect-based RS extract and analyze specific product attributes from reviews, providing tailored recommendations to the users based on item aspects [376]. This approach to RS differs with review-based RS, which assess overall user sentiment and preferences from review content.\nAspect-based RS effectively address several practical challenges by focusing on specific product attributes extracted from user reviews. These systems enhance personalization by tailoring recommendations based on individual user preferences and item characteristics.\nExplainable and Trustworthy Recommender Systems\nAdvancements in explainable and trustworthy RS have evolved, starting with phrase-level analysis of user reviews to enhance recommendation explainability by identifying critical item aspects [389]. Subsequent models like Tripartite Graph Ranking (TriRank) have improved top-N recommendations by extracting aspects from reviews and creating a user-item-aspect ternary relation [390]. Concurrently, models such as the Tree-Enhanced Embedding Model (TEM) merge embedding-based and tree-based methods with an attention network to ensure transparency, utilizing rich side information and explicit decision rules [391]. This integration extends to combining CF with structured knowledge bases and unstructured data like textual reviews for personalized and understandable recommendations [392]. Additionally, techniques like RL have been applied to generate flexible, high-quality explanations across recommendation models [251].\nRecent efforts like the Counterfactual Explainable Fairness (CEF) framework focus on identifying and mitigating fairness issues in RS [397].\nExplainable Fairness in Recommendation\nFairness, Accountability, Transparency, and Ethics (FATE) in Recommender Systems\nFairness in RS, as outlined in [401], refers to the ethical principle and requirement that recommender algorithms allocate resource (information, opportunities, or exposure) in a manner that is equitable and just across different users and items.\nPre-processing Fairness Methods Pre-processing efforts for fairness in RS involve adjusting training data, altering proportions of protected groups (like gender, race, age) through resampling [174] or adding synthetic data [402]. These methods aim to mitigate biases in input data before model training, they struggle to entirely eliminate biases that appear during training or inference.\nIn-processing Fairness Methods In-processing fairness methods in RS primarily utilize ranking approaches and advanced techniques to incorporate fairness directly into model training, yielding more immediate improvements by modifying elements closely tied to the final output. Regularization techniques play a crucial role by embedding fairness constraints or penalties into the objective function to balance accuracy with fairness\nAdversarial learning further enhances fairness by learning representations that maintain independence from sensitive attributes or ensure equitable distribution across groups\nPost-Processing Fairness Methods Post-processing methods involve adjusting the initial output of a recommendation model to satisfy certain fairness criteria before presenting the final recommendations to users.\nBias Reduction News Recommendation System\nFairness among New Items in Cold Start Recommender Systems\nApplications\nNumerous platforms have leveraged advanced RS technologies to enhance user engagement and content personalization. YouTube employs deep neural networks to refine its recommendation process, focusing on optimal ranking and selection of videos [488]. Google Play utilizes both linear models and neural networks within its Wide &amp; Deep Learning framework to achieve a balance between memorization and generalization [97]. LinkedIn enhances job and content recommendation using real-time processing and scoring mechanisms, integrating CF and deep learning to match job seekers with suitable opportunities [132, 489]. Twitter customizes its content recommendations, like tweets and follower suggestions, based on user behavior and preferences [490].\nByteDance has introduced innovative models for TikTok to quickly adapt recommendations to user interactions, employing unique retrieval models and scalable systems like Monolith, which uses collisionless embedding tables for efficient memory usage [491, 492]. Apple has developed the Sliced Anti-symmetric Decomposition (SAD) model to enhance collaborative filtering, allowing more nuanced user-item interactions, and explores controlled music production using diffusion models [493, 494]. DeepMind’s generative models improve RS by decoding Semantic IDs from user interactions, enhancing item retrieval and system performance [495]."},"recsys/Adaptive-Multi-Modalities-Fusion-in-Sequential-Recommendation-Systems":{"slug":"recsys/Adaptive-Multi-Modalities-Fusion-in-Sequential-Recommendation-Systems","filePath":"recsys/Adaptive Multi-Modalities Fusion in Sequential Recommendation Systems.md","title":"Adaptive Multi-Modalities Fusion in Sequential Recommendation Systems","links":[],"tags":["paper"],"content":"Abstract\nIn sequential recommendation, multi-modal information (e.g., text or image) can provide a more comprehensive view of an item’s profile. The optimal stage (early or late) to fuse modality features into item representations is still debated. We propose a graph-based approach (named MMSR) to fuse modality features in an adaptive order, enabling each modality to prioritize either its inherent sequential nature or its interplay with other modalities. MMSR represents each user’s history as a graph, where the modality features of each item in a user’s history sequence are denoted by cross-linked nodes. The edges between homogeneous nodes represent intra-modality sequential relationships, and the ones between heterogeneous nodes represent inter-modality interdependence relationships. During graph propagation, MMSR incorporates dual attention, differentiating homogeneous and heterogeneous neighbors. To adaptively assign nodes with distinct fusion orders, MMSR allows each node’s representation to be asynchronously updated through an update gate. In scenarios where modalities exhibit stronger sequential relationships, the update gate prioritizes updates among homogeneous nodes. Conversely, when the interdependent relationships between modalities are more pronounced, the update gate prioritizes updates among heterogeneous nodes. Consequently, MMSR establishes a fusion order that spans a spectrum from early to late modality fusion. In experiments across six datasets, MMSR consistently outperforms state-of-the-art models, and our graph propagation methods surpass other graph neural networks. Additionally, MMSR naturally manages missing modalities."},"recsys/Bayesian-Knowledge-driven-Critiquing-with-Indirect-Evidence":{"slug":"recsys/Bayesian-Knowledge-driven-Critiquing-with-Indirect-Evidence","filePath":"recsys/Bayesian Knowledge-driven Critiquing with Indirect Evidence.md","title":"Bayesian Knowledge-driven Critiquing with Indirect Evidence","links":[],"tags":["paper"],"content":"Abstract\nConversational recommender systems (CRS) enhance the expressivity and personalization of recommendations through multiple turns of user-system interaction. Critiquing is a well-known paradigm for CRS that allows users to iteratively refine recommendations by providing feedback about attributes of recommended items. While existing critiquing methodologies utilize direct attributes of items to address user requests such as ‘I prefer Western movies’, the opportunity of incorporating richer contextual and side information about items stored in Knowledge Graphs (KG) into the critiquing paradigm has been overlooked. Employing this substantial knowledge together with a well-established reasoning methodology paves the way for critique-based recommenders to allow for complex knowledge-based feedback (e.g., ‘I like movies featuring war side effects on veterans’) which may arise in natural user-system conversations. In this work, we aim to increase the flexibility of critique-based recommendation by integrating KGs and propose a novel Bayesian inference framework that enables reasoning with relational knowledge-based feedback. We study and formulate the framework considering a Gaussian likelihood and evaluate it on two well-known recommendation datasets with KGs. Our evaluations demonstrate the effectiveness of our framework in leveraging indirect KG-based feedback (i.e., preferred relational properties of items rather than preferred items themselves), often improving personalized recommendations over a one-shot recommender by more than 15%. This work enables a new paradigm for using rich knowledge content and reasoning over indirect evidence as a mechanism for critiquing interactions with CRS."},"recsys/Bias-Reduction-News-Recommendation-System":{"slug":"recsys/Bias-Reduction-News-Recommendation-System","filePath":"recsys/Bias Reduction News Recommendation System.md","title":"Bias Reduction News Recommendation System","links":[],"tags":["paper"],"content":"Abstract\nNews recommender systems (NRS) are crucial for helping users navigate the vast amount of content available online. However, traditional NRS often suffer from biases that lead to a narrow and unfair distribution of exposure across news items. In this paper, we propose a novel approach, the Contextual-Dual Bias Reduction Recommendation System (C-DBRRS), which leverages Long Short-Term Memory (LSTM) networks optimized with a multi-objective function to balance accuracy and diversity. We conducted experiments on two real-world news recommendation datasets and the results indicate that our approach outperforms the baseline methods, and achieves higher accuracy while promoting a fair and balanced distribution of recommendations. This work contributes to the development of a fair and responsible recommendation system."},"recsys/DiffKG---Knowledge-Graph-Diffusion-Model-for-Recommendation":{"slug":"recsys/DiffKG---Knowledge-Graph-Diffusion-Model-for-Recommendation","filePath":"recsys/DiffKG - Knowledge Graph Diffusion Model for Recommendation.md","title":"DiffKG - Knowledge Graph Diffusion Model for Recommendation","links":[],"tags":["paper"],"content":"Abstract\nKnowledge Graphs (KGs) have emerged as invaluable resources for enriching recommendation systems by providing a wealth of factual information and capturing semantic relationships among items. Leveraging KGs can significantly enhance recommendation performance. However, not all relations within a KG are equally relevant or beneficial for the target recommendation task. In fact, certain item-entity connections may introduce noise or lack informative value, thus potentially misleading our understanding of user preferences. To bridge this research gap, we propose a novel knowledge graph diffusion model for recommendation, referred to as DiffKG. Our framework integrates a generative diffusion model with a data augmentation paradigm, enabling robust knowledge graph representation learning. This integration facilitates a better alignment between knowledge-aware item semantics and collaborative relation modeling. Moreover, we introduce a collaborative knowledge graph convolution mechanism that incorporates collaborative signals reflecting user-item interaction patterns, guiding the knowledge graph diffusion process. We conduct extensive experiments on three publicly available datasets, consistently demonstrating the superiority of our DiffKG compared to various competitive baselines. We provide the source code repository of our proposed DiffKG model at the following link: this https URL."},"recsys/Dynamic-Graph-Neural-Networks-for-Sequential-Recommendation":{"slug":"recsys/Dynamic-Graph-Neural-Networks-for-Sequential-Recommendation","filePath":"recsys/Dynamic Graph Neural Networks for Sequential Recommendation.md","title":"Dynamic Graph Neural Networks for Sequential Recommendation","links":[],"tags":["paper"],"content":"Abstract\nModeling user preference from his historical sequences is one of the core problems of sequential recommendation. Existing methods in this field are widely distributed from conventional methods to deep learning methods. However, most of them only model users’ interests within their own sequences and ignore the dynamic collaborative signals among different user sequences, making it insufficient to explore users’ preferences. We take inspiration from dynamic graph neural networks to cope with this challenge, modeling the user sequence and dynamic collaborative signals into one framework. We propose a new method named Dynamic Graph Neural Network for Sequential Recommendation (DGSR), which connects different user sequences through a dynamic graph structure, exploring the interactive behavior of users and items with time and order information. Furthermore, we design a Dynamic Graph Recommendation Network to extract user’s preferences from the dynamic graph. Consequently, the next-item prediction task in sequential recommendation is converted into a link prediction between the user node and the item node in a dynamic graph. Extensive experiments on three public benchmarks show that DGSR outperforms several state-of-the-art methods. Further studies demonstrate the rationality and effectiveness of modeling user sequences through a dynamic graph.\nIntroduction\nAlthough these methods have achieved compelling results, we argue that these methods lack explicit modeling of the dynamic collaborative signals among different user sequences\n…(1) These models do not explicitly leverage the collaborative information among different user sequences, in other words, most of them focus on encoding each user’s own sequence, while ignoring the high-order connectivity between different user sequences,\n(2) These models ignore the dynamic influence of the high-order collaboration information at different times.\n\nfirstly, we convert all user sequences into a dynamic graph annotated with time and order information on edges (Section 4.1). Consequently, the user sequences having common items are associated with each other via user → item and item → user connections.\nSecondly, we devise a sub-graph sampling strategy (Section 4.2) to dynamically extract sub-graphs containing user’s sequence and associated sequences.\nThirdly, to encode user’s preference from the sub-graph, we design a Dynamic Graph Recommendation Network (DGRN) (Section 4.3), in which a dynamic attention module is constructed to capture the long-term preference of users and long-term character of items, and a recurrent neural module or attention module is further utilized to learn short-term preference and character of users and items, respectively.\nMethodology\nDynamic Graph Construction\nWhen the user u acts on the item i at time t, an edge e is established between u and i, and e can be represented by the quintuple (u, i, t, o^i_u, o^u_i)\no^i_u is the order of u−i interaction, that is, the position of item i in all items that the u has interacted with. o^u_i refers to the order of u in all user nodes that have interacted with item i.\n\nSub-Graph Sampling\nSpecifically, we first take user node u as the anchor node and select its most recent n first-order neighbors from graph G tk , that is, the historical items that u has interacted with, written as Nu, where n is the maximum length of user sequence (Line 5, 6, and 8 in Algorithm 1).\nNext, for each item i ∈ Nu, we use each of them as an anchor node to sample the set of users who have interacted with them, written as Ni (Line 11, 12, and 14 in Algorithm 1).\nFollowed by analogy, we can obtain the multi-hop neighbors of node u, which could forms u’s m-order sub-graph G m u (tk) of S u (m is hyper-parameter used to control the size of sub-graph).\nDynamic Graph Recommendation Networks\nSimilar to most GNNs, The DGRN component consists of message propagation and node updating components.\nThe message propagation mechanism aims to learn the message propagation information from user to item and item to user in G m u (tk), respectively. The challenge is how to encode the sequential information of neighbors from user and item perspectives, respectively.\nFrom item to user. … we need to extract two types of information from the neighbors of each user node, which are long-term preference and short-term preference respectively. The long-term preference [46] of user reflects his or her inherent characteristics and general preference, which can be induced from the user’s all historical items. The shortterm preference of the user reflects his or her latest interest.\nFrom user to item. … On the one hand, the long-term character can reflect the general characters of the item. For example, the wealthy people usually buy high-end cosmetics. On the other hand, short-term character reflects the newest property of item.\nLong-term Information.\n\nDynamic Graph Attention Mechanism.\n\nShort-term Information.\n\nNode updating\n\nRecommendation and Optimization\n"},"recsys/Explainable-Fairness-in-Recommendation":{"slug":"recsys/Explainable-Fairness-in-Recommendation","filePath":"recsys/Explainable Fairness in Recommendation.md","title":"Explainable Fairness in Recommendation","links":[],"tags":["paper"],"content":"Abstract\nExisting research on fairness-aware recommendation has mainly focused on the quantification of fairness and the development of fair recommendation models, neither of which studies a more substantial problem—identifying the underlying reason of model disparity in recommendation. This information is critical for recommender system designers to understand the intrinsic recommendation mechanism and provides insights on how to improve model fairness to decision makers. Fortunately, with the rapid development of Explainable AI, we can use model explainability to gain insights into model (un)fairness. In this paper, we study the problem of explainable fairness, which helps to gain insights about why a system is fair or unfair, and guides the design of fair recommender systems with a more informed and unified methodology. Particularly, we focus on a common setting with feature-aware recommendation and exposure unfairness, but the proposed explainable fairness framework is general and can be applied to other recommendation settings and fairness definitions. We propose a Counterfactual Explainable Fairness framework, called CEF, which generates explanations about model fairness that can improve the fairness without significantly hurting the performance. CEF framework formulates an optimization problem to learn the “minimal” change of the input features that changes the recommendation results to a certain level of fairness. Based on the counterfactual recommendation result of each feature, we calculate an explainability score in terms of the fairness-utility trade-off to rank all the feature-based explanations, and select the top ones as fairness explanations."},"recsys/Fairness-among-New-Items-in-Cold-Start-Recommender-Systems":{"slug":"recsys/Fairness-among-New-Items-in-Cold-Start-Recommender-Systems","filePath":"recsys/Fairness among New Items in Cold Start Recommender Systems.md","title":"Fairness among New Items in Cold Start Recommender Systems","links":[],"tags":["paper"],"content":"Abstract\nThis paper investigates recommendation fairness among new items. While previous efforts have studied fairness in recommender systems and shown success in improving fairness, they mainly focus on scenarios where unfairness arises due to biased prior user-feedback history (like clicks or views). Yet, it is unknown whether new items without any feedback history can be recommended fairly, and if unfairness does exist, how can we provide fair recommendations among these new items in such a cold-start scenario. In detail, we first formalize fairness among new items with the well-known concepts of equal opportunity and Rawlsian Max-Min fairness. We empirically show the prevalence of unfairness in cold start recommender systems. Then we propose a novel learnable post-processing framework as a model blueprint for enhancing fairness, with which we propose two concrete models: a joint-learning generative model, and a score scaling model. Extensive experiments over four public datasets show the effectiveness of the proposed models for enhancing fairness while also preserving recommendation utility."},"recsys/Frequency-Enhanced-Hybrid-Attention-Network-for-Sequential-Recommendation":{"slug":"recsys/Frequency-Enhanced-Hybrid-Attention-Network-for-Sequential-Recommendation","filePath":"recsys/Frequency Enhanced Hybrid Attention Network for Sequential Recommendation.md","title":"Frequency Enhanced Hybrid Attention Network for Sequential Recommendation","links":[],"tags":["paper"],"content":"Abstract\nThe self-attention mechanism, which equips with a strong capability of modeling long-range dependencies, is one of the extensively used techniques in the sequential recommendation field. However, many recent studies represent that current self-attention based models are low-pass filters and are inadequate to capture high-frequency information. Furthermore, since the items in the user behaviors are intertwined with each other, these models are incomplete to distinguish the inherent periodicity obscured in the time domain. In this work, we shift the perspective to the frequency domain, and propose a novel Frequency Enhanced Hybrid Attention Network for Sequential Recommendation, namely FEARec. In this model, we firstly improve the original time domain self-attention in the frequency domain with a ramp structure to make both low-frequency and high-frequency information could be explicitly learned in our approach. Moreover, we additionally design a similar attention mechanism via auto-correlation in the frequency domain to capture the periodic characteristics and fuse the time and frequency level attention in a union model. Finally, both contrastive learning and frequency regularization are utilized to ensure that multiple views are aligned in both the time domain and frequency domain. Extensive experiments conducted on four widely used benchmark datasets demonstrate that the proposed model performs significantly better than the state-of-the-art approaches."},"recsys/Knowledge-Prompt-tuning-for-Sequential-Recommendation":{"slug":"recsys/Knowledge-Prompt-tuning-for-Sequential-Recommendation","filePath":"recsys/Knowledge Prompt-tuning for Sequential Recommendation.md","title":"Knowledge Prompt-tuning for Sequential Recommendation","links":[],"tags":["paper"],"content":"Abstract\nPre-trained language models (PLMs) have demonstrated strong performance in sequential recommendation (SR), which are utilized to extract general knowledge. However, existing methods still lack domain knowledge and struggle to capture users’ fine-grained preferences. Meanwhile, many traditional SR methods improve this issue by integrating side information while suffering from information loss. To summarize, we believe that a good recommendation system should utilize both general and domain knowledge simultaneously. Therefore, we introduce an external knowledge base and propose Knowledge Prompt-tuning for Sequential Recommendation (KP4SR). Specifically, we construct a set of relationship templates and transform a structured knowledge graph (KG) into knowledge prompts to solve the problem of the semantic gap. However, knowledge prompts disrupt the original data structure and introduce a significant amount of noise. We further construct a knowledge tree and propose a knowledge tree mask, which restores the data structure in a mask matrix form, thus mitigating the noise problem. We evaluate KP4SR on three real-world datasets, and experimental results show that our approach outperforms state-ofthe-art methods on multiple evaluation metrics. Specifically, compared with PLM-based methods, our method improves NDCG@5 and HR@5 by 40.65% and 36.42% on the books dataset, 11.17% and 11.47% on the music dataset, and 22.17% and 19.14% on the movies dataset, respectively. Our code is publicly available at the link: github.com/zhaijianyang/KP4SR."},"recsys/PromptMM---Multi-Modal-Knowledge-Distillation-for-Recommendation-with-Prompt-Tuning":{"slug":"recsys/PromptMM---Multi-Modal-Knowledge-Distillation-for-Recommendation-with-Prompt-Tuning","filePath":"recsys/PromptMM - Multi-Modal Knowledge Distillation for Recommendation with Prompt-Tuning.md","title":"PromptMM - Multi-Modal Knowledge Distillation for Recommendation with Prompt-Tuning","links":[],"tags":["paper"],"content":"Abstract\nMultimedia online platforms (e.g., Amazon, TikTok) have greatly benefited from the incorporation of multimedia (e.g., visual, textual, and acoustic) content into their personal recommender systems. These modalities provide intuitive semantics that facilitate modality-aware user preference modeling. However, two key challenges in multi-modal recommenders remain unresolved: i) The introduction of multi-modal encoders with a large number of additional parameters causes overfitting, given high-dimensional multi-modal features provided by extractors (e.g., ViT, BERT). ii) Side information inevitably introduces inaccuracies and redundancies, which skew the modality-interaction dependency from reflecting true user preference. To tackle these problems, we propose to simplify and empower recommenders through Multi-modal Knowledge Distillation (PromptMM) with the prompt-tuning that enables adaptive quality distillation. Specifically, PromptMM conducts model compression through distilling u-i edge relationship and multi-modal node content from cumbersome teachers to relieve students from the additional feature reduction parameters. To bridge the semantic gap between multi-modal context and collaborative signals for empowering the overfitting teacher, soft prompt-tuning is introduced to perform student task-adaptive. Additionally, to adjust the impact of inaccuracies in multimedia data, a disentangled multi-modal list-wise distillation is developed with modality-aware re-weighting mechanism. Experiments on real-world data demonstrate PromptMM’s superiority over existing techniques. Ablation tests confirm the effectiveness of key components. Additional tests show the efficiency and effectiveness."},"recsys/RecMind---Large-Language-Model-Powered-Agent-For-Recommendation":{"slug":"recsys/RecMind---Large-Language-Model-Powered-Agent-For-Recommendation","filePath":"recsys/RecMind - Large Language Model Powered Agent For Recommendation.md","title":"RecMind - Large Language Model Powered Agent For Recommendation","links":[],"tags":["paper"],"content":"Abstract\nWhile the recommendation system (RS) has advanced significantly through deep learning, current RS approaches usually train and fine-tune models on task-specific datasets, limiting their generalizability to new recommendation tasks and their ability to leverage external knowledge due to model scale and data size constraints. Thus, we designed an LLM-powered autonomous recommender agent, RecMind, which is capable of leveraging external knowledge, utilizing tools with careful planning to provide zero-shot personalized recommendations. We propose a Self-Inspiring algorithm to improve the planning ability. At each intermediate step, the LLM self-inspires to consider all previously explored states to plan for the next step. This mechanism greatly improves the model’s ability to comprehend and utilize historical information in planning for recommendation. We evaluate RecMind’s performance in various recommendation scenarios. Our experiment shows that RecMind outperforms existing zero/few-shot LLM-based recommendation baseline methods in various tasks and achieves comparable performance to a fully trained recommendation model P5."},"recsys/Towards-Hierarchical-Policy-Learning-for-Conversational-Recommendation-with-Hypergraph-based-Reinforcement-Learning":{"slug":"recsys/Towards-Hierarchical-Policy-Learning-for-Conversational-Recommendation-with-Hypergraph-based-Reinforcement-Learning","filePath":"recsys/Towards Hierarchical Policy Learning for Conversational Recommendation with Hypergraph-based Reinforcement Learning.md","title":"Towards Hierarchical Policy Learning for Conversational Recommendation with Hypergraph-based Reinforcement Learning","links":[],"tags":["paper"],"content":"Abstract\nConversational recommendation systems (CRS) aim to timely and proactively acquire user dynamic preferred attributes through conversations for item recommendation. In each turn of CRS, there naturally have two decision-making processes with different roles that influence each other: 1) director, which is to select the follow-up option (i.e., ask or recommend) that is more effective for reducing the action space and acquiring user preferences; and 2) actor, which is to accordingly choose primitive actions (i.e., asked attribute or recommended item) that satisfy user preferences and give feedback to estimate the effectiveness of the director’s option. However, existing methods heavily rely on a unified decision-making module or heuristic rules, while neglecting to distinguish the roles of different decision procedures, as well as the mutual influences between them. To address this, we propose a novel Director-Actor Hierarchical Conversational Recommender (DAHCR), where the director selects the most effective option, followed by the actor accordingly choosing primitive actions that satisfy user preferences. Specifically, we develop a dynamic hypergraph to model user preferences and introduce an intrinsic motivation to train from weak supervision over the director. Finally, to alleviate the bad effect of model bias on the mutual influence between the director and actor, we model the director’s option by sampling from a categorical distribution. Extensive experiments demonstrate that DAHCR outperforms state-of-the-art methods."}}